In [1]:
print("hello")

hello

In [1]:
import pandas as pd
df = pd.DataFrame(
    { "Name" : ["Samit", "Rishabh", "Siddarth"],
      "Age" : [20, 21, 22],
      "Sub1" : [90, 80, 70],
      "Sub2" : [80,70,60],
      "Team" : ["A", "B", "A"]
    }
)
# df.head() -> prints few values

In [3]:
print(df.head())

       Name  Age  Sub1  Sub2 Team
0     Samit   20    90    80    A
1   Rishabh   21    80    70    B
2  Siddarth   22    70    60    A

In [7]:
# loc -> returns that row
print(df.loc[0:1])

      Name  Age  Sub1  Sub2 Team
0    Samit   20    90    80    A
1  Rishabh   21    80    70    B

In [8]:
grpby = df.groupby("Team")

In [13]:
grpby.get_group("A")

       Name  Age  Sub1  Sub2 Team
0     Samit   20    90    80    A
2  Siddarth   22    70    60    A

In [14]:
print(df.aggregate("Sub1"))

0    90
1    80
2    70
Name: Sub1, dtype: int64

In [15]:
print(df.aggregate({"Sub1" : ["sum"]}))

     Sub1
sum   240

In [24]:
# new col total which is sub1 + sub2
df["Total"] = df["Sub1"] + df["Sub2"]

In [17]:
df["Total"]

0    170
1    150
2    130
Name: Total, dtype: int64

In [18]:
df.head()

       Name  Age  Sub1  Sub2 Team
0     Samit   20    90    80    A
1   Rishabh   21    80    70    B
2  Siddarth   22    70    60    A

In [25]:
df.drop("Total", axis = 1, inplace = True)  # removes Total, axis = 1 : deletes column.
df.head()

       Name  Age  Sub1  Sub2 Team
0     Samit   20    90    80    A
1   Rishabh   21    80    70    B
2  Siddarth   22    70    60    A

In [27]:
df.isnull() # set errything to null

    Name    Age   Sub1   Sub2   Team
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False

In [28]:
df.fillna(0) # custom

       Name  Age  Sub1  Sub2 Team
0     Samit   20    90    80    A
1   Rishabh   21    80    70    B
2  Siddarth   22    70    60    A

In [31]:
df1 = pd.DataFrame(
    { "Name" : ["A", "B", "C"],
      "ID" : [1, 2, 3]
    }
)

df2 = pd.DataFrame(
    { "Subject" : ["OS", "DBMS", "CN"],
      "ID" : [1, 2, 3]
    }
)
df1.head()

  Name  ID
0    A   1
1    B   2
2    C   3

In [32]:
df2.head()

  Subject  ID
0      OS   1
1    DBMS   2
2      CN   3

In [34]:
df1.merge(df2, on = "ID", how = "inner") # joins

  Name  ID Subject
0    A   1      OS
1    B   2    DBMS
2    C   3      CN